micropython/micropython/ports/esp32/boards/SEEED_XIAO_ESP32C6/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "Seeed XIAO ESP32C6"
#define MICROPY_HW_MCU_NAME                 "ESP32-C6"

#define MICROPY_HW_I2C0_SCL  (23)
#define MICROPY_HW_I2C0_SDA  (22)

#define MICROPY_HW_SPI1_MOSI (18)
#define MICROPY_HW_SPI1_MISO (20)
#define MICROPY_HW_SPI1_SCK  (19)
